In [2]:
import pandas as pd

In [5]:
columns=['names','age','gender','job']
user1 = pd.DataFrame([['alice','19','F','student'],['john','26','M','engineer']],columns = columns)

In [15]:
user1.describe(include='all')
user1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
names     2 non-null object
age       2 non-null object
gender    2 non-null object
job       2 non-null object
dtypes: object(4)
memory usage: 144.0+ bytes

In [20]:
user1[['names','age']] # 选取列
df = user1.copy()
df.iloc[0] # 选取行
df.loc[::1] # 选取某些行

   names age gender       job
0  alice  19      F   student
1   john  26      M  engineer

In [28]:
# 根据某些条件进行筛选
user1[user1.age.astype(float)<20][['names','job']]
user1[user1.job.isin(['student','teacher'])]

   names      job
0  alice  student

In [42]:
fd = user1.copy()
fd.drop(fd[fd.age.astype(float)>20].index,axis=0) # 根据条件删除指定行

   names age gender      job
0  alice  19      F  student

In [38]:
fd[fd.age.astype(float)>20]

  names age gender       job
1  john  26      M  engineer